duxinglang-1/nRF9160_test/AURI_TEST/src/imu/lsm6dso.c
		if(!is_wearing())
			return;
		
		is_tilt();
		if(wrist_tilt)
		{
			LOG_INF("tilt trigger!\n");
			
			wrist_tilt = false;

			if(lcd_is_sleeping && global_settings.wake_screen_by_wrist)
			{
				sleep_out_by_wrist = true;
				lcd_sleep_out = true;
			}
		}
		else
		{
			LOG_INF("steps trigger!\n");
			
			UpdateIMUData();
			imu_redraw_steps_flag = true;	
		}
	}

	if(int2_event) //fall
	{
		int2_event = false;

		if(!imu_check_ok)
			return;
		
		if(!is_wearing()||fall_testing)
			return;

		fall_detection();
		if(fall_result)
		{
			LOG_INF("Fall trigger!\n");
			
			fall_result = false;
			lcd_sleep_out = true;
			EnterFallScreen();
			FallAlarmStart();
		}
        else
        {
			//LOG_INF("Not Fall.\n");
        }

		fall_testing = false;
	}
	
	if(reset_steps)
	{
		reset_steps = false;

		if(!imu_check_ok)
			return;
		
		ReSetImuSteps();
		imu_redraw_steps_flag = true;
	}

	if(imu_redraw_steps_flag)
	{
		imu_redraw_steps_flag = false;

		if(!imu_check_ok)
			return;
		
		IMURedrawSteps();
	}

	if(update_sleep_parameter)
	{
		update_sleep_parameter = false;

		if(!imu_check_ok)
			return;
		
		UpdateSleepPara();
	}
}

void IMU_init(struct k_work_q *work_q)
{
	LOG_INF("IMU_init\n");
	
	imu_work_q = work_q;
	k_work_init(&imu_work, mt_fall_detection);
	
	if(init_i2c() != 0)
		return;
	
	init_gpio();

	imu_dev_ctx.write_reg = platform_write;
	imu_dev_ctx.read_reg = platform_read;
	imu_dev_ctx.handle = i2c_imu;

	imu_check_ok = sensor_init();
	if(!imu_check_ok)
		return;
	
	lsm6dso_steps_reset(&imu_dev_ctx); //reset step counter
	lsm6dso_sensitivity();
	StartSleepTimeMonitor();

	LOG_INF("IMU_init done!\n");
}

/*@brief Check if a wrist tilt happend
*
* @return If tilt detected, wrist_tilt=true, otherwise false
*/
void is_tilt(void)
{
	lsm6dso_all_sources_t status;

	lsm6dso_all_sources_get(&imu_dev_ctx, &status);
	if(status.fsm_status_a.is_fsm1)
	{ 
		//tilt detected
		wrist_tilt = true;
	}
}

/*@brief disable the wrist tilt detection
*
*/
void disable_tilt_detection(void)
{
	lsm6dso_all_sources_t status;
	
	lsm6dso_fsm_enable_get(&imu_dev_ctx, &fsm_enable);
	fsm_enable.fsm_enable_a.fsm1_en = PROPERTY_DISABLE;
	lsm6dso_fsm_enable_set(&imu_dev_ctx, &fsm_enable);
}

/*@brief enable the wrist tilt detection
*
*/
void enable_tilt_detection(void)
{
	lsm6dso_all_sources_t status;
	
	lsm6dso_fsm_enable_get(&imu_dev_ctx, &fsm_enable);
	fsm_enable.fsm_enable_a.fsm1_en = PROPERTY_ENABLE;
	lsm6dso_fsm_enable_set(&imu_dev_ctx, &fsm_enable);
}

void test_i2c(void)
{
	struct device *i2c_dev;
	struct device *dev0;

	dev0 = device_get_binding("GPIO_0");
	gpio_pin_configure(dev0, 0, GPIO_DIR_OUT);
	gpio_pin_write(dev0, 0, 1);

	LOG_INF("Starting i2c scanner...\n");

	i2c_dev = device_get_binding(IMU_DEV);
	if(!i2c_dev)
	{
		LOG_INF("I2C: Device driver not found.\n");
		return;
	}
	i2c_configure(i2c_dev, I2C_SPEED_SET(I2C_SPEED_STANDARD));
	uint8_t error = 0u;

	LOG_INF("Value of NRF_TWIM1_NS->PSEL.SCL: %ld \n",NRF_TWIM1_NS->PSEL.SCL);
	LOG_INF("Value of NRF_TWIM1_NS->PSEL.SDA: %ld \n",NRF_TWIM1_NS->PSEL.SDA);
	LOG_INF("Value of NRF_TWIM1_NS->FREQUENCY: %ld \n",NRF_TWIM1_NS->FREQUENCY);
	LOG_INF("26738688 -> 100k\n");
	LOG_INF("67108864 -> 250k\n");
	LOG_INF("104857600 -> 400k\n");

	for (u8_t i = 0; i < 0x7f; i++)
	{
		struct i2c_msg msgs[1];
		u8_t dst = 1;

		/* Send the address to read from */
		msgs[0].buf = &dst;
		msgs[0].len = 1U;
		msgs[0].flags = I2C_MSG_WRITE | I2C_MSG_STOP;

		error = i2c_transfer(i2c_dev, &msgs[0], 1, i);
		if(error == 0)
		{
			LOG_INF("0x%2x device address found on I2C Bus\n", i);
		}
		else
		{
			//LOG_INF("error %d \n", error);
		}
	}
}

void IMURedrawSteps(void)
{
	if(screen_id == SCREEN_ID_STEPS)
	{
		StepsUpdateStatus();
	}
}

void IMUMsgProcess(void)
{
	k_work_submit_to_queue(imu_work_q, &imu_work);
}
